
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
   /*20. З початку доби минуло N секунд (N - ціле). Знайти кількість повних
годин, що минули з початку доби.*/

    
   cout << "Integer 20"<<endl<<endl; //назва завдання
   
   int S, H; //declaration
   
   cout << "З початку доби минуло:" << endl; // ввід змінної
   cin >> S;
   H = S / 3600; // підрахунок годин
   cout << "Кількість повних годин, що минули з початку доби: " << H << endl <<  endl; // виведення шуканої змінної та результату
   
    /*Дано координати двох різних полів шахової дошки x1, y1, x2, y2 (цілі числа,
що лежать в діапазоні 1-8). Перевірити істинність висловлювання: «Кінь за
один хід може перейти з одного поля на інше».*/


cout << "Boolean 40" <<endl<<endl;

//declaration
int x1, y1, x2, y2;
bool is_horse; 
cin >> x1 >> y1 >> x2 >> y2; // ввід змінних
is_horse = (abs(x1-x2) == 2) && (abs(y1-y2) == 1) == 2 || abs(x1-x2) == 1 && abs(y1-y2) == 2; // перевірка істини
    cout << "Кінь за один хід може перейти з одного поля на інше:" << boolalpha << is_horse << endl << endl; // виведення перевірки
    
    //вираз 29
    
    cout << "Вираз 29"<<endl <<endl;
    
     //declaration
     float y, a, b, c, x;
    cout << "x=" ;
    cin >> x; // ввід змінної
    
    a = pow (abs ( pow (x, 3) / 4 - pow (sin(pow (x, 3)), 2) * 2), 1 / 3); // 1 частина виразу
    b = log10 (abs (x)) / log10 (5); // 2 частина
    c = pow (2, x) * sqrt (abs (3 * x + 2.5 * abs (tan (x)))); // 3 частина
    y = a * b / c; // виведення заданого виразу у скороченому форматі
    if (c == 0) cout << "Немає рішення"; // перевірка
    else cout << "y="<< y << endl; 
    
    return 0;
}



